Обработки/Reports/_НастройкиКлиентскихОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_НастройкиКлиентскихОтчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОтчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отчеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_НастройкиКлиентскихОтчетов/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		"ДополнительныйОтчет",
		"Настройки клиентских отчетов",
		"0.2",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Возвращает табличный документ с результатом формирования отчета
//	Параметры:
//		- УчитываяСрокФормирования	- учитывать значение настройки "Срок формирования" или нет
//		- Отбор						- структура с возможными параметрами отбора
//		- ВыводитьВсе				- необходимость вывода не только отклонений (не только не выполненные действия)
//
Функция Сформировать(УчитываяСрокФормирования = Истина, Отбор = Неопределено) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".Сформировать()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Дата,Организация,ГруппаОтчетов,Настройка");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ГруппаОтчетов) Тогда
		
		Если Отбор = Неопределено Тогда
			Отбор = Новый Структура("ГруппаОтчетов", ЭтотОбъект.ГруппаОтчетов);
		Иначе
			Отбор.Вставить("ГруппаОтчетов", ЭтотОбъект.ГруппаОтчетов);
		КонецЕсли;
		
	КонецЕсли;
	
	СоставИНастройкиОтчетовИсходнаяТаблица = РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьСоставИНастройкиОтчетовНаДату(ЭтотОбъект.Организация, ЭтотОбъект.Дата, Истина, Отбор, , Истина);
	
	СоставИНастройкиОтчетов = СоставИНастройкиОтчетовИсходнаяТаблица.Скопировать(, "Субъект, Отчет, ГруппаОтчетов, Периодичность");
	СоставИНастройкиОтчетов.Свернуть("Субъект, Отчет, ГруппаОтчетов, Периодичность");
	СоставИНастройкиОтчетов.Колонки.Добавить("АдресНастроек");
	
	Для Каждого Отчет Из СоставИНастройкиОтчетов Цикл 
		
		НайдСтроки = СоставИНастройкиОтчетовИсходнаяТаблица.НайтиСтроки(Новый Структура("Субъект, Отчет, ГруппаОтчетов, Периодичность", Отчет.Субъект, Отчет.Отчет, Отчет.ГруппаОтчетов, Отчет.Периодичность));
		Отчет.АдресНастроек = НайдСтроки[0].АдресНастроек;
		
	КонецЦикла;	
	
	ТипИдентификатора = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36, ДопустимаяДлина.Переменная));
	СоставИНастройкиОтчетов.Колонки.Добавить("ИдентификаторСтроки", ТипИдентификатора);
	
	ОписаниеПриоритетов = РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьСоответствиеВидовНастроекПриоритету();
		
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка			= Макет.ПолучитьОбласть("Шапка");	
	ОбластьСтрокаНастройки	= Макет.ПолучитьОбласть("СтрокаНастройки");
	ОбластьПодвал			= Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка.Параметры.Дата			= Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.Организация	= ЭтотОбъект.Организация;	
	ОбластьШапка.Параметры.Настройка	= ЭтотОбъект.Настройка;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ГруппаОтчетов) Тогда
		ОбластьШапка.Параметры.ГруппаОтчетов = СтрШаблон(" по группе отчетов '%1'", ЭтотОбъект.ГруппаОтчетов);
	КонецЕсли;
	
	Результат.Вывести(ОбластьШапка);
	
	КодНастройки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Настройка, "Код");
	
	НастройкаСвязанаСЭДО = КодНастройки = "ВыгружатьОтчетВСоставеПакета" 
					Или КодНастройки = "КаталогФайловДляОтправкиПоЭДО"
					Или КодНастройки = "КаталогФайловСОшибкойОтправкиПоЭДО"
					Или КодНастройки = "МаксимальныйРазмерФайлаДляВыгрузкиВЭДО"
					Или КодНастройки = "РучнаяЗагрузкаФайловВЭДО";
					
	НастройкаСвязанаСОтправкойПоПочте = КодНастройки = "АдресОтправителя"
								Или КодНастройки = "АдресЭлектроннойПочты"
								Или КодНастройки = "АдресЭлектроннойПочтыБухгалтерии"
								Или КодНастройки = "АдресЭлектроннойПочтыБэкОфиса"
								Или КодНастройки = "МаксимальныйСуммарныйРазмерфайловПисьма"
								Или КодНастройки = "ОтправлятьОтчетВСоставеПакета";
	                           		
	Для Каждого Отчет Из СоставИНастройкиОтчетов Цикл
		
		НастройкиОтчета = ПолучитьИзВременногоХранилища(Отчет.АдресНастроек);
		
		ИспользуетсяВыгрузкаВЭДО 	= Ложь;
		ИспользуетсяОтправкаПоПочте	= Ложь;
		
		Для Каждого НастройкаОтчета Из НастройкиОтчета Цикл
			
			Если НастройкаОтчета.КодНастройки = "АвтоматическаяВыгрузкаВЭДО" И НастройкаОтчета.Значение = Истина Тогда
				ИспользуетсяВыгрузкаВЭДО = Истина;
				Продолжить;
			ИначеЕсли НастройкаОтчета.КодНастройки = "АвтоматическаяОтправка" И НастройкаОтчета.Значение = Истина Тогда	
				ИспользуетсяОтправкаПоПочте = Истина;
				Продолжить;
			ИначеЕсли НастройкаОтчета.Настройка <> ЭтотОбъект.Настройка Тогда
				Продолжить;
			ИначеЕсли НастройкаСвязанаСЭДО И Не ИспользуетсяВыгрузкаВЭДО 
					Или НастройкаСвязанаСОтправкойПоПочте И Не ИспользуетсяОтправкаПоПочте Тогда
				Продолжить;
			КонецЕсли;
				
			ОбластьСтрокаНастройки.Параметры.Договор			= Отчет.Субъект;
			ОбластьСтрокаНастройки.Параметры.Отчет				= Отчет.Отчет;
			ОбластьСтрокаНастройки.Параметры.Периодичность		= Отчет.Периодичность;
			ОбластьСтрокаНастройки.Параметры.Значение			= НастройкаОтчета.Значение;
			ОбластьСтрокаНастройки.Параметры.ДатаЗначения		= Формат(НастройкаОтчета.ДатаЗначения, "ДФ=dd.MM.yyyy");
			ОбластьСтрокаНастройки.Параметры.Приоритет			= НастройкаОтчета.Приоритет;
			
			ОписаниеПриоритета = ОписаниеПриоритетов.Получить(НастройкаОтчета.Приоритет);
			ОписаниеПриоритета = СтрЗаменить(ОписаниеПриоритета , "Настройка", "Уровень");
			ОписаниеПриоритета = СтрЗаменить(ОписаниеПриоритета , "определенной", "заданной");

			ОбластьСтрокаНастройки.Параметры.Описание			= ОписаниеПриоритета;
			
			Результат.Вывести(ОбластьСтрокаНастройки);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Результат.Вывести(ОбластьПодвал);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
	Возврат Результат;
	
КонецФункции
